[
    {
     "name": "Abbott (Robert) Park",
     "address": "\n          \n                    49 E. 95th St.             Chicago, IL 60628    \n          \n          ",
     "description": "\n        \n        Located in the Roseland Community Area, Abbott Park totals 25 acres and features a multi-purpose room and game room. Outside, the park offers four baseball diamonds, basketball, track and tennis courts, swimming pool, and two sprinklers. Many of these spaces are available for rental including our multi-purpose room and game room.Park-goers can participate in seasonal sports, cheerleading, aerobics, senior and teen clubs. On the cultural side, Abbott Park offers dance, music and movement. After school programs are offered throughout the school year, and during the summer youth can attend the Park District’s popular six-week day camp.Specialty camps, including Sports Camp, are also offered in the summer.In addition to programs, Abbott Park hosts fun special events throughout the year for the entire family including holiday events.  \n        \n        ",
     "history": "\n        \n        The Chicago Park District acquired the site of Abbott Park as part of a ten-year plan to increase recreational opportunities in under-served neighborhoods in post-World War II Chicago.  In 1947, the Citizens Advisory Committee on Park Sites recommended the creation of a park to serve the rapidly growing African-American community near 95th Street and Michigan Avenue.  The Park District purchased the property southeast of that intersection in 1949 and 1950, and built a swimming pool and recreational facility the following year.  In 1956, the District sold a portion of the parkland to the Board of Education for use as Harlan High School.Robert Sengstacke Abbott (1868-1940), for whom the park is named, founded the influential Chicago Defender in 1905.  Born in Georgia, Abbott received his education in southern schools, and graduated from Chicago's Kent College of Law.  He was the only African-American in the class of 1899.  Abbott's lofty goal was to eliminate racial prejudice through his newspaper.  To promote racial equality, Abbott and his Chicago Defender newspaper urged southern blacks to migrate to Chicago and other northern cities for greater economic opportunity.  By 1918, the influential newspaper had a national circulation of 125,000, making it the largest-selling black newspaper in the country.  President of his Abbott Publishing Company, Abbott was also active in civic affairs.  He served on Governor Frank O. Lowden's Race Relations Committee in 1919, on the Board of Commissioners of the Chicago World's Fair in 1934, and on the boards of the Art Institute, the Field Museum, and the Chicago Historical Society. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/1"
    },
    {
     "name": "Ada (Sawyer Garrett) Park",
     "address": "\n          \n                    11250 S. Ada St.             Chicago, IL 60643    \n          \n          ",
     "description": "\n        \n        Located in the Morgan Park Community Area, Ada Park totals 16.65 acres and features an auditorium, gymnasium, fitness center, and multi-purpose clubrooms. Outside, the park offers a swimming pool, baseball diamonds, basketball/tennis courts. Many of these spaces are available for rental including our auditorium, gymnasium and multi-purpose clubrooms.Park-goers can participate in Park Kids, seasonal sports, tumbling, teen, and senior clubs. After school programs are offered throughout the school year, and in the summer youth attend the Park District’s popular six-week day camp.In addition to programs, Ada Park hosts fun special events including family holiday themed celebrations throughout the year for the entire family. \n        \n        ",
     "history": "\n        \n        Created in 1930, Ada Park provided recreational facilities for the Morgan Park neighborhood's expanding African-American population. Initially, acquisition began in 1930.  Acquisition to expand the park was finalized in 1955; streets and alleys were vacated in 1957 to complete the 16.65-acre park.  The park was the last of those developed by the Calumet Park District, established in 1903. The Calumet Park District was one of 22 neighborhood park boards consolidated into the Chicago Park District in 1934. By 1931, Ada Park had a swimming pool and a few landscape improvements. After the Chicago Park District took control of the park in 1934, other recreational facilities were installed. The Park District erected a new bathhouse for the swimming pool in 1940, and built \"fieldhouse additions\" to the bathhouse in 1957 and 1990.Until 1934, Ada Park was known as Loomis Street Park, for the street running along its west side. Late in that year, the Calumet Park District voted to change the name to Ada Park, for the street on the park's opposite side. The street is named for Ada Sawyer Garrett (1856-1938), who sold the last remaining vacant land in the Logan Square neighborhood, the Logan Square Ball Park, to developers in 1924. Though the Chicago Park District informed the Calumet Park District that it had no authority to rename the site Ada Park, the name has been used ever since. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/2"
    },
    {
     "name": "Adams (George & Adele) Park",
     "address": "\n          \n                    1919 N. Seminary Ave.             Chicago, IL 60614    \n          \n          ",
     "description": "\n        \n        Tucked away in Lincoln Park Community Area, Adams Playground is truly a treasure in the community and welcomes neighbors into the park year-round. The park is 0.78 acres and features a small field house that hosts indoor activities for the little ones - from Moms, Pops and Tots to Summer Camps.The talented and dedicated staff at Adams Playground invites you to stop by and check out what’s happening at the park.For those interested in using the picnic tables on the weekends - a permit is required. Please check with park staff on availability.  \n        \n        ",
     "history": "\n        \n        Established in 1902, Adams Park bears the name of attorney and Congressman George Adams (1840-1917) and his wife Adele (Foster) Adams. George and Adele gave the City of Chicago use of two-thirds of an acre of property in their Lincoln Park neighborhood as parkland. Placed under the jurisdiction of the City's Special Park Commission, on which George Adams served, Adams Park had playground apparatus, a shelter house, and sand court as early as 1904. In 1910, the Adamses conveyed title to the property to the City. By 1916, the Special Park Commission had added a playing field that was flooded in winter for ice skating. The City transferred Adams Park to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act. In 1997, a new interactive waterplay area, named for retired school teacher Dorothy Melamerson, opened in Adams Park. Ms. Melamerson provided funding for the children's water feature through a bequest in her will. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/3"
    },
    {
     "name": "Adams (John C.) Park",
     "address": "\n          \n                    7535 S. Dobson Ave.             Chicago, IL 60619    \n          \n          ",
     "description": "\n        \n        Located in the Greater Grand Crossing Community Area, Adams Park totals 1.01 acres and is a park location used for passive recreation. Park patrons can relax in this open green space while enjoying the beauty of nature. \n        \n        ",
     "history": "\n        \n        In 1881, the City of Chicago acquired a triangular property in Greater Grand Crossing from the community's original developer, Paul Cornell. A quarter-century later, renowned landscape architect Jens Jensen, a member of the City's Special Park Commission, reported that the triangle had deteriorated into \"a truck garden in a mud hole, surrounded by ditches...into which the sewage emptied.\" He further described it as \"the site of a dog pound, with other sorry-looking shacks for ornament, all bordered by a rotten plank walk on two sides.\" In 1907, Jensen began improving the site with proper drainage, substantial walks, trees, and shrubbery. In subsequent years, the Commission seeded the lawns, planted additional trees, and installed a drinking fountain. Between the early 1920s and the mid-1940s, the depressed lawn was flooded in winter for ice skating. In 1957, the City transferred Adams Park to the Chicago Park District pursuant to the Chicago Park and City Exchange of Functions Act.  The Chicago Park District has maintained it as a greenspace for passive recreation ever since. The origin of the Adams Park name is unclear. Hyde Park historian Steve Treffman believes the park may have been named for John C. Adams, an official of the Cornell Watch Company, which stood across 76th Street from the park around 1900. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/4"
    },
    {
     "name": "Addams (Jane) Memorial Park",
     "address": "\n          \n                    550 E. Grand Ave.             Chicago, IL 60611    \n          \n          ",
     "description": "\n        \n        This small park totals 4.31 acres and is nestled on the edge of our quaint Ohio Street Beach and adjacent to the bustling Near North Community Area, which includes our neighbor Navy Pier.  While there is no structured programming taking place at this location, we invite you to stop by nearby Lake Shore Park to use the outdoor track or workout in the fitness center. \n        \n        ",
     "history": "\n        \n        Between 1914 and 1916, the City created a municipal pier and a neighboring park by filling in submerged land east of Lake Shore Drive and north of Grand Avenue. The new municipal pier was almost immediately pressed into service as a naval training site during World War I, and in 1927, the city renamed the structure Navy Pier in honor of the trainees. The adjacent park also took the new name.Navy Pier Park, like other City parks was transferred to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act. In 1996, the Park District officially re-designated the park Jane Addams Memorial Park in honor of the world-renowned social reformer and Nobel Peace Prize winner. Addams founded one of North America's first settlement houses, Chicago's Hull House, which provided much-needed social services and cultural opportunities to its near west side immigrant neighborhood. Addams also worked tirelessly to promote various legal reforms, including the first juvenile-court law and an eight-hour working day for women.A six-piece sculptural grouping honoring Addams by Louise Bourgeois called \"Helping Hands\" was originally installed at Addams Memorial Park. Unfortunately, the sculptures were severely vandalized and had to be removed. \"Helping Hands\" was later restored and relocated to Chicago Women's Park and Gardens where it continues to serve as a monument to Addams' work in Chicago.  \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/5"
    },
    {
     "name": "Addams (Jane) Park",
     "address": "\n          \n                    1434 S. Loomis             Chicago, IL 60608    \n          \n          ",
     "description": "\n        \n        NEW RECREATION CENTER AT ADDAMS PARKThe Chicago Park District has constructed a new fieldhouse at Addams Park. The ComEd Recreation Center is now open for public use. Indoor facilities include an artificial turf football/soccer practice field, a three-lane running track, a gymnasium, and a clubroom. Outside, the building there is an artificial turf football/soccer field and an artificial turf baseball field.This small park is located in the Near West Side Community Area. The park totals 9.23 acres.    \n        \n        ",
     "history": "\n        \n        In the late 1940s, Addams Park's Near West Side neighborhood was decaying and congested. The Chicago Park District established the much-needed park in 1946, part of a ten-year plan to increase recreational opportunities in under-served neighborhoods after World War II.Land acquisition proved problematic, however, and demolition of the site's dilapidated buildings did not begin until 1952. The Chicago Park District acquired the majority of the land for the park from 1952 until 1954.  In 2020, the Chicago Park District added a new fieldhouse to the park.The park's name honors Jane Addams (1860-1935), the world-renowned social reformer who devoted her life to serving the economic and social needs of the Near West Side's disadvantaged immigrant community. Addams' base of operations was her Hull House on nearby Halsted Street, one of North America's first settlement houses. In addition to her work in Chicago, Addams actively promoted national legal reforms, including tenement-house regulation, factory inspection, and workers' compensation. Addams was awarded the 1931 Nobel Peace Prize for her efforts. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/6"
    },
    {
     "name": "Admin Building",
     "address": "\n          \n                    541 N. Fairbanks Ct.             Chicago, IL 60611    \n          \n          ",
     "description": "\n        \n        The Chicago Park District's administrative offices are located in the city's Streeterville neighborhood.  When Board meetings are held at this location, they typically take place in the meeting room on the 8th floor. \n        \n        ",
     "history": "",
     "url": "https://scrapple.fly.dev/parks/7"
    },
    {
     "name": "Aiello (John) Park",
     "address": "\n          \n                    2133 N. McVicker Ave.             Chicago, IL 60602    \n          \n          ",
     "description": "\n        \n        This park totals 0.39 acres and is located in the Belmont-Cragin Community Area (one block west of Austin Avenue and approximately 1 ½ blocks south of Grand Avenue).  Come out enjoy the lovely playground with your kids!While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Riis Park. \n        \n        ",
     "history": "\n        \n        This former City park was transferred to the Chicago Park District pursuant to the Chicago Park and City Exchange of Functions Act in 1957.  In 1973, Park 1280 was designated Oak Park. After the sudden death of long-time 36th Ward Alderman John F. Aiello, former constituents suggested that a park should be named in his honor. Aiello was known for his active participation in little league baseball and football programs in the parks within his ward. In 1980, the year of his death, the Park District recognized Aiello's interest in the parks by renaming Oak Park in his memory. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/8"
    },
    {
     "name": "Algonquin Park",
     "address": "\n          \n                    2941 N. Washtenaw Ave.             Chicago, IL 60618    \n          \n          ",
     "description": "\n        \n        This small park totals 0.16 acres and is located in the Avondale Community Area, two blocks east of California Avenue and approximately 1 ½ blocks north of Diversey Avenue.While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Brands Park. \n        \n        ",
     "history": "\n        \n        The City of Chicago created Algonquin Park in 1949, transferring it to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act. Initially developed as a small gravel playlot, the site was rehabilitated in 1970, and again in 1990 as part of the Park District’s soft surface playground program. For many years, the property was known as Washtenaw Park, presumably for the street on which it is located. In 1999, the Park District changed the park's name to Algonquin to avoid confusion with a second Washtenaw Park located on Chicago's south side. The Algonquins were a large family of Native American tribes linked by language. At one time, the Algonquins occupied territory extending from the east coast to the Rocky Mountains, a larger area of North America than any other Native American group. A number of Algonquin tribes lived in Wisconsin, Illinois, Indiana, Michigan, and Ohio. These included the Menominee, Sauk, Fox, Kickapoo, Mascouten, Potowatomi, and Miami. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/9"
    },
    {
     "name": "Almond Park",
     "address": "\n          \n                    2234 W. 115th St.             Chicago, IL 60643    \n          \n          ",
     "description": "\n        \n        Located in the Morgan Park Community Area, Almond Park totals 0.74 acres and is a park location used for passive recreation. Park patrons can relax in this open green space while enjoying the beauty of nature. \n        \n        ",
     "history": "\n        \n        The oval-shaped tract of land now known as Almond Park was once the site of the Village of Morgan Park's water works.  The Village of Morgan Park acquired half of the property in 1887.  After the City of Chicago annexed the Village in 1914, the City transferred maintenance of the property to the Calumet Park District, one of 22 independent park commissions consolidated into the Chicago Park District in 1934. The Calumet Park District took control of the water works site in 1920, but never improved it. The property was transferred to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act.  The Park District officially named the tiny greenspace Almond Park in 1974. The park was one of a number of properties named for trees and plants at this time. The ancient almond tree, mentioned frequently in the Old Testament, had its origins in China. The tree produces the world's most popular nut. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/10"
    },
    {
     "name": "Altgeld (John) Park",
     "address": "\n          \n                    515 S. Washtenaw Ave.             Chicago, IL 60612    \n          \n          ",
     "description": "\n        \n        Located in the East Garfield Park Community Area, Altgeld Park totals 4.77 acres and features a fieldhouse, two gymnasiums, a fitness center, meeting rooms and a kitchen.Outside, the park offers a swimming pool and and a multi-purpose artificial turf athletic field for football, baseball, soccer and more. The park also includes a small playground that was renovated in Fall 2013 as part of the Chicago Plays! playground initiative. Many of these spaces are available for rental, including the ball fields and meeting rooms.Park patrons visit Altgeld Park to play football, baseball or soccer, and children enjoy the playground. After school programs are offered throughout the school year, and in the summer youth attend the Park District’s popular six-week day camp. In addition to programs, the park hosts fun special events throughout the year for the whole family, such as gymnastics showcases, egg hunts, Movies in the Park and other Night Out in the Parks events.  \n        \n        ",
     "history": "",
     "url": "https://scrapple.fly.dev/parks/11"
    },
    {
     "name": "Amundsen (Roald) Park",
     "address": "\n          \n                    6200 W. Bloomingdale Ave.             Chicago, IL 60639    \n          \n          ",
     "description": "\n        \n        Tucked away in the Austin Community Area (between Austin & Nagle Avenues, and between Fullerton & North Avenues), Amundsen Park covers 16.24 acres. Its fieldhouse is equipped with a gymnasium, fitness center, and club rooms. Outside, the park features baseball/softball fields, football/soccer field, volleyball and basketball court, as well as playground with a water spray feature.Amundsen Park offers a variety of programs for youth, including seasonal sports instruction, day camp, as well as the Park Kids after school program which provides special supervised activities during school holidays.Teens can enjoy socializing with their peers at Teen Club. Adults can keep fit participating in the park’s sports leagues and in the fitness center. \n        \n        ",
     "history": "\n        \n        Amundsen Park is among the thirteen parks created by the Northwest Park District. The Northwest Park District began to purchase land for the park in 1925, on the recommendation of its Committee on Park Sites. By 1928, the Northwest Park District completed the land acquisition for the park and the North Austin Community Club was urging speedy improvement of the property. Before the end of that year, the Park District had acquired the remainder of the park's 13.33 acres, contracted for playground equipment, and approved fieldhouse plans. By 1931, some improvements had been made, but a plea by the North Austin Manor Neighborhood Club to move ahead with the fieldhouse could not be honored due to the District's financial condition.  The Northwest Park District designated the park Roald Amundsen Park in 1933; two years after rejecting a petition to name the park for Norwegian-born football coach Knute Rockne (1888-1931). The Norwegian National League suggested the Amundsen name as a way to honor Norwegian polar adventurer Roald Amundsen (1872-1928). Amundsen led many scientific explorations in the Arctic and Antarctic, but is best known for discovering the South Pole on December 4, 1911. In 1928, Amundsen's plane disappeared near the North Pole as he led a search for a missing Italian dirigible.In 1934, the Northwest Park District was one of the 22 park districts that were consolidated into the Chicago Park District, and Amundsen Park became part of the Chicago Park District’s portfolio.  The Chicago Park District eventually constructed the Amundsen Park fieldhouse in 1954. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/12"
    },
    {
     "name": "Anderson (Fred) Park",
     "address": "\n          \n                    1611 S. Wabash Ave.             Chicago, IL 60616    \n          \n          ",
     "description": "\n        \n        Fred Anderson Park is a new 1.20 acre park in the Near South Side Community Area. The park features two enclosed dog friendly areas, one for small dogs and one for large dogs. Each area is complete with artificial turf, water play fountains, tunnel and shade structures, benches, picnic tables, Omega style safety fencing and a dog-friendly drinking fountains. Fred Anderson Park also includes a stage area with a seating wall for performances by local artists. The stage areas includes shade structures, electrical service and benches. While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Chicago Women's Park.  \n        \n        ",
     "history": "\n        \n        In 2008, the City of Chicago acquired just over one acre of property at 16th St. and Wabash Ave. to provide parkland within a redeveloped area of the Near South Side Community Area. The City of Chicago transferred the park to the Chicago Park District in 2015. The Chicago Park District took over the design, development, and management of the park.Park District staff members and Altamanu, a landscape architecture and urban planning firm, worked closely with community members to create plans for the park. It includes a dog friendly area, lawn, trees and benches, as well as a stage area with a seating wall for performances by musicians and other local artists.In 2011, the Chicago Park District Board of Commissioners named the new park in honor of Fred Anderson an internationally acclaimed jazz musician who lived only a few blocks away from 2101 South Michigan Avenue and in close proximity to the original site of the Velvet Lounge, Anderson’s bar that became known as one of Chicago’s most important jazz venues.  Born in Monroe, Louisiana Fred Anderson (1929 – 2010) began teaching himself to play the piano at the age of five and took up the tenor saxophone as a teenager. He married in 1950, worked various odd jobs to support his family, and played the saxophone in his spare time. Although he did not play professionally until he was in his thirties, audiences and other musicians quickly recognized his great talent.In the mid 1960s, Anderson was one of the original Chicago members of the Association for the Advancement of Creative Musicians. He and his band played in the first AACM concert. Anderson soon made a recording, “Song For” on Delmark Records, which proved to be the first of more than thirty albums he recorded. Around this time, he became known as the “Lone Prophet of the Prairie,” in part because of the fact he played with such a unique and distinctive style.Making his first trip to perform in Europe in 1977, Anderson gained quick popularity, travelling and performing throughout the US as well as Austria, Canada, Croatia, France, Germany, Italy, Poland, Serbia, Slovenia, Sweden, and Switzerland. Despite his widespread fame, he maintained strong ties with Chicago. In 1982, he began to help a sick friend run the Velvet Lounge at 2128 ½ South Indiana Avenue. When his friend died, Anderson took over the bar and transformed it into internationally renowned venue for creative music.Fred Anderson mentored many younger musicians, performed at numerous Chicago Jazz Festivals, and contributed to the vitality of Chicago for decades. He was always true to his motto of “patience, sincerity, and consistency.” \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/13"
    },
    {
     "name": "Anderson (Louis) Park",
     "address": "\n          \n                    3748 South Prairie Avenue             Chicago, IL 60653    \n          \n          ",
     "description": "\n        \n        Located in the Douglas Community Area, Anderson Park totals 1 acre. The park is named for attorney Louis B. Anderson, who served as 2nd Ward alderman from 1917 to 1933. Anderson Park offers indoor and outdoor basketball courts and a playground that was recently renovated as part of the Chicago Plays! playground initiative.The park sits adjacent to the Mayo Elementary School and Ida B. Wells Preparatory Elementary School campus and shares a baseball field with these schools. In the fieldhouse, the park offers a gymnasium and a meeting room. Many of these spaces are available for rental for children's parties, community meetings and other events. After school programs are offered throughout the school year, and in the summer youth attend the Park District’s popular six-week day camp. The park also hosts special events throughout the year including Night Out in the Parks and Movies in the Park events.  \n        \n        ",
     "history": "\n        \n        Anderson Park takes its name from attorney Louis B. Anderson (1870-1946), 2nd Ward alderman from 1917 to 1933. The Chicago City Council purchased the site of Anderson Park from the Olivet Baptist Church in 1926, and the City's Bureau of Parks began to develop the property the following year. In 1957, the property was transferred to the Chicago Park District pursuant to the Chicago Park and City Exchange of Functions Act. In 1994, the City acquired property adjacent to the park. In 1996, the City transferred this property to the Park District for the expansion of the park. The Park District replaced a small recreational building constructed by the City with a new fieldhouse in 1981. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/14"
    },
    {
     "name": "Andersonville Park",
     "address": "\n          \n                    5233 N. Ashland Ave.             Chicago, IL 60640    \n          \n          ",
     "description": "\n        \n        This quaint park totals 0.19 acres and is located in the Edgewater Community Area (on Ashland Avenue, one block north of Foster Avenue). The playground was renovated in Spring 2015 as part of the Chicago Plays! renovation program.While there is no structured programming taking place at this location, we invite you to check out our programs offered at nearby Winnemac Park. \n        \n        ",
     "history": "\n        \n        The City of Chicago owned the property at 5233 N. Ashland, and in 1950 acquired the adjacent property, and then established Ashland Playlot. By the end of that year, the new park had a sandbox and a playfield that could be flooded for ice-skating in winter. Not long after, the City's Bureau of Parks and Recreation installed slides, swings, a merry-go-round, and a jungle gym.  In 1957, the park was transferred to the Chicago Park District pursuant to the Chicago Park and City Exchange of Functions Act. The Park District rehabilitated the playground in 1964, and again in 1992.  Known for years as Ashland Playlot for the adjacent street, the property was officially renamed Andersonville Park in 1993, at the request of neighborhood residents.  Andersonville Park is named for the Andersonville section of the Edgewater Community Area. The neighborhood began to develop rapidly in the early 1900’s, when the City's elevated trains first reached the area. Around World War I, large numbers of Swedish immigrants moved north to Andersonville from earlier \"Swede Towns\" on Chicago's Near North Side and Lake View Community Areas. After World War II, many early Andersonville residents moved on to the Rogers Park Community Area and northern suburbs, but the community still celebrates its Swedish heritage with ethnic shops and restaurants, and a Swedish American museum. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/15"
    },
    {
     "name": "Arcade Park",
     "address": "\n          \n                    11132 S. St. Lawrence Ave.             Chicago, IL 60628    \n          \n          ",
     "description": "\n        \n        Located in the Pullman Community Area, Arcade Park totals 1.25 acres and is a park location used for passive recreation. Park patrons can relax in this open green space while enjoying the beauty of nature and a garden-like setting. \n        \n        ",
     "history": "\n        \n        Arcade Park is one of two parks donated to the town of Pullman by its founder, George M. Pullman (1831-1899). (The other is nearby Pullman Park.) The City of Chicago acquired Arcade Park in 1910. George Pullman vastly improved the comfort of long distance rail travel when he introduced the sleeping car that bears his name. In 1877, George Pullman began to purchase 3,500 acres on the western shore of Lake Calumet on which to build his new Pullman Palace Car Works. In 1880, he began construction of the enormous plant and surrounding company town. Pullman hired architect Solon S. Beman to design the town's buildings and Nathan F. Barrett to plan the landscape. The designers placed Arcade Park, with its formal \"carpet bed\" plantings, directly opposite the Arcade, an enormous iron and glass structure housing shops, a post office, a library, and a theater. Though its namesake park remains, the impressive building was demolished in 1926. The City transferred Arcade Park to the Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/16"
    },
    {
     "name": "Archer (William Beatty) Park",
     "address": "\n          \n                    4901 S. Kilbourn Ave.             Chicago, IL 60632    \n          \n          ",
     "description": "\n        \n        Located in the Archer Heights Community Area, Archer Park totals 14.06 acres and features a gymnasium, kitchen, and fitness center. Outside, the park offers an interactive water spray feature, baseball fields, a basketball court, an athletic field for football and soccer, a horseshoe area and a playground.Many of these spaces are available for rental for private parties or sports activities.Park-goers can play baseball, football and soccer sports at the facility. After school programs are offered throughout the school year, and in the summer youth attend the Park District’s popular six-week day camp. In addition to programs, Archer Park hosts fun special events throughout the year for the whole family, such as Movies In the Park. \n        \n        ",
     "history": "\n        \n        Archer Park takes its name from the surrounding Archer Heights community. The community and its main artery, Archer Avenue, are named for Col. William Beatty Archer (1793-1870), a Commissioner for the Illinois and Michigan Canal, which paralleled the road in the 1800s. Archer, an abolitionist as well as a civil engineer, nominated Abraham Lincoln for Vice President in 1856. The Chicago Park District acquired land from 1949-1950 and established Archer Park to provide green space in an area then experiencing significant industrial development. The new park was part of a ten-year, district-wide program to increase recreational opportunities in underserved neighborhoods in post-World War II Chicago. Archer Park provided solely outdoor recreational facilities until 1970, when the Park District constructed a small fieldhouse. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/17"
    },
    {
     "name": "Armour (Philip) Square Park",
     "address": "\n          \n                    3309 S. Shields Ave.             Chicago, IL 60616    \n          \n          ",
     "description": "\n        \n        Located in the Armour Square Community Area, Armour Square Park totals 8.98 acres. Many Chicagoans know Armour Square as the park across the street from the Chicago White Sox stadium. The fieldhouse features a fitness center, two gymnasiums and an auditorium, along with meeting rooms.Outside, the park offers junior and senior baseball fields, an athletic field for football and soccer, tennis courts, a playground and an outdoor pool. The playground was renovated in Fall 2013 as part of the Chicago Plays! playground initiative. Many of these spaces are available for rental.Park-goers come to Armour Square for baseball or volleyball or to exercise in the fitness center. After school programs are offered throughout the school year, and in the summer youth attend the Park District’s popular six-week day camp. In addition to programs, Armour Square Park hosts fun special events throughout the year for the whole family, such as egg hunts, holiday parties and Movies in the Park. \n        \n        ",
     "history": "\n        \n        The South Park Commissioners acquired the land for this park in 1904.  Development of the park included a fieldhouse, with four clubrooms, two gymnasiums, an assembly hall, and large lobby.  Outdoor amenities such as lawns, walks, and plantings were installed and recreational facilities included an outdoor swimming pool, baseball and football fields, handball and tennis courts, and a children’s playground.  The development was completed in 1905 and there was a dedication of the park that same year.  In 1906, the year after Armour Square opened to the public, President Theodore Roosevelt described the square and nine other related properties as \"the most notable civic achievement in any American city.\"  The South Park Commission created the ten new innovative parks to improve the difficult living conditions in Chicago's congested tenement districts. Nationally renowned landscape architects the Olmsted Brothers and architects Daniel H. Burnham and Co. designed the entire system.  The South Park Commission was one of 22 independent park commissions consolidated into the Chicago Park District in 1934. The first ten included five squares smaller than ten acres in size, and five parks larger than ten acres. In addition to Armour Square, these were Mark White, Russell, Davis and Cornell Squares, and Ogden, Sherman, Palmer, Bessemer and Hamilton Parks. These properties soon influenced the development of other parks throughout the nation.An ordinance was passed on August 17, 1904 to name the park Armour Square to honor Philip D. Armour (1832-1901), Chicago's \"captain of industry.\" Owner and operator of the largest meatpacking company in the world, Armour donated a large amount of his fortune to charitable and educational institutions. These included a settlement house, the Armour Mission, and a school known as the Armour Institute of Technology, later renamed the Illinois Institute of Technology. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/18"
    },
    {
     "name": "Armstrong (Lillian Hardin) Park",
     "address": "\n          \n                    4433 S. St. Lawrence Ave.             Chicago, IL 60653    \n          \n          ",
     "description": "\n        \n        This small park totals 9.27 acres and is located in the Grand Boulevard Community Area. The park features baseball diamonds, basketball courts and a playground that was renovated in Fall 2013 as part of the Chicago Plays! Program. While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Kennicott Park for recreation.   \n        \n        ",
     "history": "\n        \n        Park No. 492 became part of the Park District’s park portfolio in 1993. The park was renamed Lillian Hardin Armstrong Park in 2004 as part of an effort by the Chicago Park District Board of Commissioners to recognize the contributions of Chicago women.  Armstrong (c, 1898 – 1971) was a jazz musician, composer and bandleader. A member of the Chicago band known as the New Orleans Creole Band in the 1920’s, she met and married trumpeter Louis Armstrong in 1924. After separating from Louis in 1931, she led two all-women bands, played piano on many recordings, and composed many songs, including “Just a Thrill,” which became a hit for Ray Charles. Throughout the rest of her life, she played a major role in Chicago’s music scene. She died in Chicago in 1971 during a tribute concert to Louis Armstrong, who had passed away the month before. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/19"
    },
    {
     "name": "Arrigo (Victor) Park",
     "address": "\n          \n                    801 S. Loomis St.             Chicago, IL 60607    \n          \n          ",
     "description": "\n        \n        This park totals 7.23 acres and is located in the Near West Side Community Area.  It is a passive community park adjacent to the University of Illinois campus.While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Sheridan Park for recreation on the artificial turf baseball field and get in shape in the indoor pool. \n        \n        ",
     "history": "\n        \n        Arrigo Park, known as Vernon Park for much of its history, dates to 1859, when real estate developer Henry D. Gilpin donated the property to the City of Chicago. The City soon created a shaded \"breathing spot\" with an artificial lake and a few benches.In 1871, the modest residences surrounding Vernon Park fell to the flames of the Chicago Fire. Commercial institutions and transient rooming houses took their place. The park had deteriorated into a boggy mess as surrounding streets and structures were raised up to improve sewage removal and prevent flooding.When the City transferred control and maintenance of Vernon Park to the West Park Commission in 1885, rehabilitation began immediately. To alleviate the drainage problem, the Commission filled the artificial lake and raised the ground level of the entire site with additional fill. In 1893, the Commission undertook extensive landscape improvements and electrified the park. In 1934, with the consolidation of the 22 park districts into one, the Chicago Park District, Vernon Park came under the control and management of the new District. In 1957, the Chicago Park District acquired title to the property pursuant to the Chicago Park and City Exchange of Functions Act.  In 1972, the City of Chicago conveyed adjacent property to the Chicago Park District for expansion of the park. In 1974, Vernon Park was officially renamed Arrigo Park in honor of Victor Arrigo (1908-1973). A vocal advocate for the Italian-American community, Arrigo served as Illinois State Representative for Chicago's near southwest side from 1966 to 1973.Arrigo was instrumental in bringing sculptor Moses Ezekiel's statue of Christopher Columbus to the park in 1966. First exhibited in the Italian pavilion at the 1893 World's Columbian Exposition, the bronze figure later graced a second-story alcove on State Street's Columbus Memorial Building.After the building came down in 1959, the statue went into storage. Arrigo argued that Columbus should find a new home in the City's oldest continuously Italian-American neighborhood, which was then experiencing wrenching transformation due to the construction of the University of Illinois' Circle Campus. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/20"
    },
    {
     "name": "Ashe (Arthur) Beach Park",
     "address": "\n          \n                    2701 E. 74th St.             Chicago, IL 60649    \n          \n          ",
     "description": "\n        \n        Located in the South Shore Community Area, Ashe Beach Park totals 2.31 acres and is an ideal location for family gatherings, and to enjoy nature. Ashe Beach Park has a playground and outdoor tennis courts. \n        \n        ",
     "history": "\n        \n        Ashe Beach Park lies along Lake Michigan in Chicago's South Shore Community Area. The Chicago Park District purchased the park site in 1979 with the help of Community Development Block Grant funds, and developed the park during the 1980’s through an Illinois Department of Conservation grant. In October 1993, the Park District officially designated the park Arthur Ashe Beach and Park in honor of tennis champion Arthur Ashe (1943-1993), who had died earlier that year of complications due to AIDS. The South Shore community believed that the name change would inspire young people to use the park.At the top of his tennis game, Ashe ranked No. 1 in the world and won three of four Grand Slam tournaments, the U.S. Open, Wimbledon, and the Australian Open. As captain of the Davis Cup team, he recorded 13 wins, leading the U.S. to consecutive victories in 1981 and 1982. Ashe also served as chairman of the Black Tennis and Sports Foundation, a non-profit group devoted to assisting black athletes and sports organizations. In addition, he was active in creating inner-city youth tennis camps in Chicago and elsewhere. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/21"
    },
    {
     "name": "Ashmore Park",
     "address": "\n          \n                    4807 W. Gunnison St.             Chicago, IL 60630    \n          \n          ",
     "description": "\n        \n        This tiny park totals 0.16 acres and is located in the Forest Glen Community Area (one block north of Lawrence Avenue, on Cicero Avenue, west of the Edens Expressway). While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Jefferson Park. \n        \n        ",
     "history": "",
     "url": "https://scrapple.fly.dev/parks/22"
    },
    {
     "name": "Aspen Park",
     "address": "\n          \n                    4237 S. Wabash Ave.             Chicago, IL 60653    \n          \n          ",
     "description": "\n        \n        Aspen Playlot Park totals 0.23 acres is located in the Grand Boulevard Community Area. The park was renovated in 2016 as part of Mayor Emanuel’s Chicago Plays! Program. It is an active community park. While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Fuller Park.  \n        \n        ",
     "history": "\n        \n        The Chicago Park District acquired this park site in 1969, and officially named it Aspen Park in 1974. Aspen Park was one of a number of properties the Park District named for trees and plants at this time. The District's park naming committee felt that neighborhood children could relate well to park names chosen from nature.The Aspen tree, with its brilliant white bark, provides an especially appropriate name for this park, given its Wabash Avenue location. Wabash means, \"gleaming white\" in the Sioux language. Before the Chicago Fire, the stretch of Wabash Avenue extending into the Loop was a much-admired, tree-lined avenue of beautiful homes owned by wealthy Chicagoans. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/23"
    },
    {
     "name": "Aster Park",
     "address": "\n          \n                    4639 N. Kenmore Ave.             Chicago, IL 60640    \n          \n          ",
     "description": "\n        \n        This small park totals 0.18 acres and offers community residents a playground with a water spray feature. It is located in the Uptown Community Area (one block west of Sheridan Road, 1 ½ blocks south of Lawrence Avenue).As part of the ChicagoPlays! playground renovation program the playlot received a new colorful playground. It's a great place for the kiddos and families to hang out and play! While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Chase Park. \n        \n        ",
     "history": "\n        \n        The Chicago Park District acquired tiny Aster Park in 1969 to provide the densely populated Uptown neighborhood with much-needed recreational facilities. Officially, designated Aster Park in 1975, the site was one of a number of park properties named for trees and plants at this time. The word aster is Latin for \"star,\" a reference to the flower's star-like shape. Originally a North American plant, the aster's range spread to Europe when botanist John Tradescant the younger brought it back across the Atlantic Ocean from Virginia in 1637. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/24"
    },
    {
     "name": "Athletic Field Park",
     "address": "\n          \n                    3546 W. Addison St.             Chicago, IL 60618    \n          \n          ",
     "description": "\n        \n        Located in the Irving Park Community Area - just off the Kennedy Expressway at Addison and Drake. Athletic Field Park totals 4.30 acres and contains an ADA accessible soft-surface playground and spray feature, outdoor basketball and tennis courts, and ball fields as well as a field house and a ceramics building.Filled with activities from cultural to sports programs and early childhood classes Athletic Field Park is the place to be year-round. The ceramics classes remain one of Athletic Field Park's most popular programs at the park. In the summer, youth attend our popular and always affordable 6-week day camp…filled with tons of fun. Teens should check out the new DJing program!Seasonal special events are very well attended by the community. During the summer season the park is host to the popular Summer Dance series and in the fall there is the annual halloween bash. \n        \n        ",
     "history": "\n        \n        Created by the Irving Park District, Athletic Field Park takes its name from the recreational facilities it provides. In 1923, Irving Park District began acquiring land in the southeastern part of its community, a lovely tree-lined neighborhood of apartment buildings, bungalows, and fine homes.  The land acquisition for the park was completed the following year.  Clarence Hatzfeld, architect of several nearby Villa District residences as well as many north- and northwest-side park fieldhouses, designed three structures for Athletic Field Park.  Constructed in 1926, these included an attractive Spanish Revival-style fieldhouse, a smaller locker and game room building, and a children's playground shelter. The four-acre park also had an athletic field with grandstands, a junior baseball field, separate boys' and girls' playgrounds, a wading pool, a sand box, and horseshoe and tennis courts. Four years after Athletic Field Park opened, due to a lack of use of the junior baseball field, and an increasing demand for tennis courts, the Commissioners replaced the ballfield area with additional tennis courts.Athletic Field Park became part of the Chicago Park District’s inventory in 1934, when the Great Depression necessitated the consolidation of the City's 22 independent park agencies. In the early 1960’s, the Park District converted the park's locker and game room into a ceramics studio. In 1969, further improvements were made to the ceramics building, including the installation of additional kilns.  Ceramics classes remain a popular program at Athletic Field Park. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/25"
    },
    {
     "name": "Auburn Park",
     "address": "\n          \n                    406 W. Winneconna Pkwy.             Chicago, IL 60620    \n          \n          ",
     "description": "\n        \n        Located in the Greater Grand Crossing Community Area, Auburn Park totals 5.35 acres and is a tranquil oasis in the heart of the city. This park offers a lagoon, a waterfall and benches. In this green space, popular activities park patrons and their families participate in are fishing and picnics. \n        \n        ",
     "history": "\n        \n        Created as part of a speculative real estate development, Auburn Park lies within an area once known as Cummorn. William B. Ogden, Chicago’s first mayor and early real estate promoter, owned much of the property in this area. A marshy area, the land originally drained seven miles southeast into the Calumet River. The first railroad line was constructed in 1852, and by the early 1870s, three other railroads ran through the community. Railroad workers began building homes in the area, and in 1872, the Auburn settlement was platted. Eggleston Mallette, purchased the area in the 1870s and Brownell real estate speculators, who subdivided, drained, and began developing the land. Within several years, a second group of real estate developers, Sanford McKnight, Henry Mather and Alfred Manning, purchased the property. Sometime between the 1870s and 1890s, one of the two groups of developers created Auburn Park, an 8-acre landscape with a meandering lagoon, a remnant of the site's original wetlands. The park helped to establish the area as an attractive and desirable community. In 1887, the Auburn Park Subdivision created this private park.  In 1889, the Auburn community was annexed with Chicago. The following year, the City began maintaining the park, although it was still privately owned. Local residents wanted the site to become a public park. Between 1911 and 1913, the Auburn Park Improvement Association acquired and transferred the park to the City. The deed included covenants requiring that the land will forever be used as a park; the park and lagoon will always be maintained; and the name Auburn Park will never be changed. Considered the \"beauty spot of Auburn,\" the park has long provided a calm refuge from the \"weary\" City. Auburn Park was transferred from the City to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act. The Chicago Department of Transportation restored the parks historic bridges in the late 1990s. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/26"
    },
    {
     "name": "Augusta (Carpenter) Park",
     "address": "\n          \n                    4433 W. Augusta Blvd.             Chicago, IL 60651    \n          \n          ",
     "description": "\n        \n        Located in the Humboldt Park Community Area, Augusta Park totals 1.05 acres and features a small fieldhouse for children and community gatherings. Outside, the park offers a playground area and baseball field.Many of these spaces are available for rental for community meetings and small birthday parties.After school programs are offered throughout the school year, and in the summer youth attend the Park District’s popular six-week day camp. Specialty camps are offered in the fall and spring as well, including winter and spring break camps.In addition to programs, Augusta Park hosts fun special events throughout the year for the whole family, such as egg hunts, Earth Day clean-ups and Movies in the Park screenings. \n        \n        ",
     "history": "\n        \n        The City of Chicago purchased the property for Augusta Park in 1932. The City's Bureau of Parks and Recreation operated the park until 1957, when it was transferred to the Chicago Park District pursuant to the Chicago Park and City Exchange of Functions Act.Although there is no clear record of this park's naming, the Bureau of Parks and Recreation often used adjacent street names for purposes of identification. Augusta Boulevard apparently takes its name from Augusta Carpenter, daughter of Philo Carpenter (1805-1886), Chicago's first druggist. Carpenter traveled from Chicago to Troy, New York by mail coach and Indian canoe in 1832. Upon arrival, he opened a drug store near the river on what is now Lake Street. By 1834, he had made a fortune investing in real estate. Carpenter later became a vocal advocate of abolitionism and temperance, and served as a director of the Chicago Theological Seminary. The Chicago Park District has recognized Carpenter's role in the City's early history by naming another park for him. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/27"
    },
    {
     "name": "Austin (Henry) Park",
     "address": "\n          \n                    5951 W. Lake St.             Chicago, IL 60644    \n          \n          ",
     "description": "\n        \n        This small park totals 4.67 acres and is located in the Austin Community Area. The park features a water feature and a playground that was renovated in Summer 2016 as part of Mayor Emanuel’s Chicago Plays! Program. While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Austin Town Hall Park. \n        \n        ",
     "history": "\n        \n        In 1865, Henry W. Austin (1828-1889) purchased 280 acres of poorly drained prairie land in Cicero Township. Within the next few years, Austin subdivided the area, laid out streets, and planted trees, calling the new development Austinville. Twenty years later, in December 1885, Henry Austin and his wife Martha donated three large lots to the Town of Cicero for use as a public park.Austin Park became Chicago's responsibility in 1899, after the area was annexed to the City. In 1906, noted landscape architect and Special Park Commission member Jens Jensen drew up a plan for the long, narrow site along the Chicago & Northwestern Railroad embankment. The park's most notable landscape feature was a meandering lagoon, with boys' and girls' wading pools and a wooden bridge at one end, and small wooded islands at the other. In 1908, the Special Park Commission added a dressing room facility with a 10-foot pergola and electric lights for night swimming.The lagoon was heavily used from the first. In 1910, the Special Park Commission invited underprivileged children from the City's settlement houses to use the wading pools, providing them with free bathing suits. Fifty-five thousand children used the wading pools during the summer of 1915. By 1930, attendance had increased to nearly 90,000. In the wintertime, children also ice skated on the frozen lagoons.The City transferred Austin Park to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act. By this time, the lagoon had deteriorated, and the Park District soon filled in the eastern section. At the lagoon's west end, the Park District transformed the boys' and girls' wading pools into a wading pool and spray pool, and constructed a new changing facility. In 1992, the Park District installed the first soft surface playground where the eastern portion of the lagoon once lay. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/28"
    },
    {
     "name": "Austin Foster Park",
     "address": "\n          \n                    6020 W. Foster Ave.             Chicago, IL 60630    \n          \n          ",
     "description": "\n        \n        This park totals 4.97 acres and contains a junior baseball field, softball field, and playground. It is located in the Jefferson Park Community Area, right at the juncture of Austin and Foster Avenues.While there is no structured programming taking place at this location, we invite you to check out our great programs offered at nearby Dunham Park. \n        \n        ",
     "history": "\n        \n        In 1934, the Board of Education acquired land at Austin and Foster Avenues, which would eventually become a park.  As early as 1960, residents of the Jefferson Park Community Area expressed the need for a playground and softball field in their community. In 1965, the Chicago Park District began leasing an almost 5-acre site in the neighborhood owned by the Board of Education. Playground equipment and a ball diamond were installed the following year. In early 1991, the Board of Education formally transferred the site to the Chicago Park District, which promptly constructed a new soft surface playground. Installation of new trees and plantings followed in subsequent years. For nearly three decades, the site was known only as Park No. 285. In 1993, the Park District officially designated the property Austin-Foster Park, a name commonly used by area residents. The name makes reference to the two adjacent streets, Austin Avenue and Foster Avenue. Austin Boulevard recognizes Henry W. Austin (1828-1889), who purchased prairie land west of Chicago in 1865 and laid out the town of Austinville (later the City's Austin community) not long thereafter. Foster Avenue honors John H. Foster (1796-1874), a physician and landowner who arrived in Chicago around 1835. Foster served on both the Chicago and Illinois Boards of Education. \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/29"
    },
    {
     "name": "Austin Town Hall Park",
     "address": "\n          \n                    5610 W. Lake St.             Chicago, IL 60644    \n          \n          ",
     "description": "\n        \n        Located in the Austin Community Area, Austin Town Hall Park and Cultural Center totals 3.69 acres. The park features a a fieldhouse with an indoor swimming pool, two kitchens, a gymnasium, a performance theater/auditorium and a fitness center. Outside, the park offers a basketball court and children’s playground. Many of these spaces in the Cultural Center and on the park grounds are available for rent for activities such as theater productions, family reunions or community meetings.Majestic in design, the Austin Town Hall Park and Cultural Center was once the town hall of the Village of Cicero, Illinois. Today, the space is used for park activities including a variety of dance, music and theater classes, music production and more. After school programs are offered throughout the school year at Austin Town Hall Park, and in the summer youth attend the Park District’s popular six-week day camp. Specialty camps are offered in the fall and spring, and recreational opportunities are also available during winter and spring break camps.In addition to programs, Austin Town Hall Park hosts fun special events throughout the year for the whole family, including gym showcases, children's theater productions, dance recitals, Earth Day celebrations, SummerDance, and other Night Out in the Parks special events.  \n        \n        ",
     "history": "\n        \n        In 1865, businessman and real estate speculator Henry W. Austin created a lovely 280-acre subdivision in Cicero Township. Austin's development included wide, tree-lined streets and a small park, originally known as Holden Park. The township selected Austin as its seat of government, and in 1870 constructed a brick town hall building, with a cupola and eclectic details, in the center of Holden Park.In 1898, residents of Austin, having a majority on Cicero's town council, used political influence to allow the extension of the Lake Street elevated line into their community. This infuriated residents of other areas within Cicero Township, such as Oak Park and Berwyn, who retaliated the following year by holding a joint election to force Austin's annexation to the City of Chicago. Much to the dismay of local residents, this effort succeeded and Austin became part of Chicago in 1899. The City took over the Cicero Town Hall and began using it as a library and police station as well as for other public functions.The City passed an ordinance that granted control of Holden Park to the West Park Commission in 1927. This was subject to a 99-year lease the City granted to the Chicago Public Library and also required the West Park Commissioner to build a community building in Holden Park. Because the old town hall had housed a branch library for several years, the West Park Commissioners agreed to the construction of a new public library in the park, designed by architect Alfred S. Alschuler. This public library is still operating today. At the same time, the West Park Commission also built a fieldhouse for the newly renamed Austin Town Hall Park. The large brick Georgian Revival-style building was influenced by Philadelphia's Independence Hall.  The structure was designed by architects Michaelsen and Rognstad, who were also responsible for other notable park buildings including the Garfield Park Gold Dome Building, the Humboldt and Douglas Park Fieldhouses.  The construction of the Austin Town Hall fieldhouse was completed in 1929.In 1934, with the Park Consolidation Act, the 22 park districts were merged into one, the Chicago Park District, and Austin Town Hall Park came under the jurisdiction of the Chicago Park District.  The City transferred Austin Town Hall Park to the Chicago Park District in 1957 pursuant to the Chicago Park and City Exchange of Functions Act.  \n        \n        ",
     "url": "https://scrapple.fly.dev/parks/30"
    }
   ]